[Killed] EqualityOperator
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:14:21
     this.items = items;
   }
   updateQuality() {
-    for (var i = 0; i < this.items.length; i++) {
+    for (var i = 0; i >= this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
killedBy: Gilded Rose works with empty shop
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:15:11
   }
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (this.items[i].name == 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 31 to equal 29

[Killed] LogicalOperator
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:15:11
   }
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (this.items[i].name != 'Aged Brie' || this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Backstage passes to a TAFKAL80ETC concert quality does not change when above 50
statusReason: expected 50 to equal 51

[Killed] ConditionalExpression
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:16:13
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
+        if (true) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
             this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose Quality doesn't go below 0
statusReason: expected -1 to equal 0

[Killed] BlockStatement
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:22:41
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
-        }
+        if (this.items[i].quality < 50) {}
       }
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin above 11
statusReason: expected 49 to equal 50

[Killed] BlockStatement
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:24:82
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1;
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1;
-              }
-            }
-          }
+          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {}
         }
       }
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases more when below 50 and sellin between 6 and 11
statusReason: expected 31 to equal 32

[Killed] EqualityOperator
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:44:17
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
+            if (this.items[i].quality <= 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
                 this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose Quality goes down faster when sellin at 0
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
GildedRose-Refactoring-Kata/js-mocha/src/gilded_rose.js:44:17
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
+            if (false) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
                 this.items[i].quality = this.items[i].quality - 1;
killedBy: Gilded Rose Quality goes down faster when sellin at 0
statusReason: expected 4 to equal 3
