[Killed] BlockStatement
tdd/js-mocha/src/gilded_rose.js:8:21
     this.quality = quality;
   }
 
-  increaseQuality() {
-    if (this.quality >= 50) return
-
-    this.quality = this.quality + 1;
-  }
+  increaseQuality() {}
 
   decreaseQuality() {
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin above 11
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:9:9
   }
 
   increaseQuality() {
-    if (this.quality >= 50) return
+    if (true) return
 
     this.quality = this.quality + 1;
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin above 11
statusReason: expected 49 to equal 50

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:9:9
   }
 
   increaseQuality() {
-    if (this.quality >= 50) return
+    if (false) return
 
     this.quality = this.quality + 1;
killedBy: Backstage passes to a TAFKAL80ETC concert quality does not change when above 50
statusReason: expected 52 to equal 51

[Killed] ArithmeticOperator
tdd/js-mocha/src/gilded_rose.js:11:20
   increaseQuality() {
     if (this.quality >= 50) return
 
-    this.quality = this.quality + 1;
+    this.quality = this.quality - 1;
   }
 
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin above 11
statusReason: expected 48 to equal 50

[Killed] BlockStatement
tdd/js-mocha/src/gilded_rose.js:14:21
     this.quality = this.quality + 1;
   }
 
-  decreaseQuality() {
-    if (this.quality <= 0) return
-
-    this.quality = this.quality - 1;
-  }
+  decreaseQuality() {}
 }
 
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 30 to equal 29

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:15:9
   }
 
   decreaseQuality() {
-    if (this.quality <= 0) return
+    if (false) return
 
     this.quality = this.quality - 1;
killedBy: Gilded Rose Quality goes down to 0
statusReason: expected -1 to equal 0

[Killed] EqualityOperator
tdd/js-mocha/src/gilded_rose.js:15:9
   }
 
   decreaseQuality() {
-    if (this.quality <= 0) return
+    if (this.quality > 0) return
 
     this.quality = this.quality - 1;
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 30 to equal 29

[Killed] ArithmeticOperator
tdd/js-mocha/src/gilded_rose.js:17:20
   decreaseQuality() {
     if (this.quality <= 0) return
 
-    this.quality = this.quality - 1;
+    this.quality = this.quality + 1;
   }
 }
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 31 to equal 29

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:27:11
   }
   updateQuality() {
     for (const item of this.items) {
-      if (item.name == "Sulfuras, Hand of Ragnaros") continue;
+      if (true) continue;
       item.sellIn = item.sellIn - 1;
 
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 30 to equal 29

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:27:11
   }
   updateQuality() {
     for (const item of this.items) {
-      if (item.name == "Sulfuras, Hand of Ragnaros") continue;
+      if (false) continue;
       item.sellIn = item.sellIn - 1;
 
killedBy: Sulfuras, Hand of Ragnaros quality never decreases
statusReason: expected 28 to equal 30

[Killed] ArithmeticOperator
tdd/js-mocha/src/gilded_rose.js:28:21
   updateQuality() {
     for (const item of this.items) {
       if (item.name == "Sulfuras, Hand of Ragnaros") continue;
-      item.sellIn = item.sellIn - 1;
+      item.sellIn = item.sellIn + 1;
 
       if (item.name == "Aged Brie") {
killedBy: Gilded Rose Quality goes down faster when sellin at 0
statusReason: expected 4 to equal 3

[Killed] EqualityOperator
tdd/js-mocha/src/gilded_rose.js:32:13
 
       if (item.name == "Aged Brie") {
         item.increaseQuality()
-        if (item.sellIn < 0) {
+        if (item.sellIn <= 0) {
           item.increaseQuality()
         }
killedBy: Aged Brie quality does not increase when sellin is at 1 and quality at 40
statusReason: expected 42 to equal 41

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:32:13
 
       if (item.name == "Aged Brie") {
         item.increaseQuality()
-        if (item.sellIn < 0) {
+        if (true) {
           item.increaseQuality()
         }
killedBy: Aged Brie quality does not increase when sellin is at 1 and quality at 40
statusReason: expected 42 to equal 41

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:38:11
         continue;
       }
 
-      if (item.name == "Backstage passes to a TAFKAL80ETC concert") {
+      if (false) {
         if (item.sellIn < 0) {
           item.quality = 0;
killedBy: Backstage passes to a TAFKAL80ETC concert quality does not change when above 50
statusReason: expected 50 to equal 51

[Killed] BlockStatement
tdd/js-mocha/src/gilded_rose.js:38:69
         continue;
       }
 
-      if (item.name == "Backstage passes to a TAFKAL80ETC concert") {
-        if (item.sellIn < 0) {
-          item.quality = 0;
-          continue;
-        }
-        
-        item.increaseQuality()
-
-        if (item.sellIn < 10) {
-          item.increaseQuality()
-        }
-        if (item.sellIn < 5) {
-          item.increaseQuality()
-        }
-        continue;
-      }
+      if (item.name == "Backstage passes to a TAFKAL80ETC concert") {}
 
       item.decreaseQuality()
killedBy: Backstage passes to a TAFKAL80ETC concert quality does not change when above 50
statusReason: expected 50 to equal 51

[Killed] EqualityOperator
tdd/js-mocha/src/gilded_rose.js:39:13
       }
 
       if (item.name == "Backstage passes to a TAFKAL80ETC concert") {
-        if (item.sellIn < 0) {
+        if (item.sellIn <= 0) {
           item.quality = 0;
           continue;
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases even more when below 50 and sellin below 5
statusReason: expected 0 to equal 33

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:39:13
       }
 
       if (item.name == "Backstage passes to a TAFKAL80ETC concert") {
-        if (item.sellIn < 0) {
+        if (false) {
           item.quality = 0;
           continue;
killedBy: Backstage passes to a TAFKAL80ETC concert quality hits zero when sellin below 0
statusReason: expected 33 to equal 0

[Killed] BlockStatement
tdd/js-mocha/src/gilded_rose.js:46:31
         
         item.increaseQuality()
 
-        if (item.sellIn < 10) {
-          item.increaseQuality()
-        }
+        if (item.sellIn < 10) {}
         if (item.sellIn < 5) {
           item.increaseQuality()
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases more when below 50 and sellin between 6 and 11
statusReason: expected 31 to equal 32

[Killed] ConditionalExpression
tdd/js-mocha/src/gilded_rose.js:46:13
         
         item.increaseQuality()
 
-        if (item.sellIn < 10) {
+        if (true) {
           item.increaseQuality()
         }
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin at 11
statusReason: expected 32 to equal 31

[Killed] EqualityOperator
tdd/js-mocha/src/gilded_rose.js:49:13
         if (item.sellIn < 10) {
           item.increaseQuality()
         }
-        if (item.sellIn < 5) {
+        if (item.sellIn >= 5) {
           item.increaseQuality()
         }
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases when below 50 and sellin at 11
statusReason: expected 32 to equal 31

[Killed] BlockStatement
tdd/js-mocha/src/gilded_rose.js:49:30
         if (item.sellIn < 10) {
           item.increaseQuality()
         }
-        if (item.sellIn < 5) {
-          item.increaseQuality()
-        }
+        if (item.sellIn < 5) {}
         continue;
       }
killedBy: Backstage passes to a TAFKAL80ETC concert quality increases even more when below 50 and sellin below 5
statusReason: expected 32 to equal 33

[Killed] EqualityOperator
tdd/js-mocha/src/gilded_rose.js:57:11
 
       item.decreaseQuality()
 
-      if (item.sellIn < 0) {
+      if (item.sellIn >= 0) {
         item.decreaseQuality()
       }
killedBy: Gilded Rose Quality normally goes down
statusReason: expected 28 to equal 29
